In [1]:
import pandas as pd

In [ ]:
df = pd.read_csv('your file')

A Series is a one-dimensional labeled array in Pandas. It can be thought of as a single column of data with labels or indices for each element. You can create a Series from various data sources, such as lists, NumPy arrays, or dictionaries
Here's a basic example of creating a Series in Pandas:

In [2]:
import pandas as pd

# creating a series from a list
data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

accessing the elements in the series

In [3]:
print(s[2]) #accessing the element with label 2 value is 30

30

accessing by position

In [5]:
print(s.iloc[3]) #accessing the element at position 3 that is value is 40

40

Accessing the multiple elements

In [6]:
print(s[1:4])

1    20
2    30
3    40
dtype: int64

# creating DataFrame from Dictionaries

In [10]:
import pandas as pd

#creating a dataframe from a dictionary
data = {'Name':['Ashok', 'Kashi', 'Anish','Binod'],
       'Age':[22, 34, 23, 67],
       'City':['Jhapa', 'morang', 'Sunsari', 'Dang']}\

df = pd.DataFrame(data)
print(df)

    Name  Age     City
0  Ashok   22    Jhapa
1  Kashi   34   morang
2  Anish   23  Sunsari
3  Binod   67     Dang

In [11]:
print(df['City']) #selecting specific columns

0      Jhapa
1     morang
2    Sunsari
3       Dang
Name: City, dtype: object

# accessing Rows

In [13]:
print(df.iloc[2]) #accessing third row by position
print('-------------')
print(df.loc[1]) #accessing second row by label

Name      Anish
Age          23
City    Sunsari
Name: 2, dtype: object
-------------
Name     Kashi
Age         34
City    morang
Name: 1, dtype: object

# Slicing

In [18]:
print(df[['Name', 'Age']]) #slecting specific columns
print('-------------------')
print(df[1:3])

    Name  Age
0  Ashok   22
1  Kashi   34
2  Anish   23
3  Binod   67
-------------------
    Name  Age     City
1  Kashi   34   morang
2  Anish   23  Sunsari

In [19]:
# finding unique elements:

unique_dates = df['Age'].unique()

In [20]:
unique_dates

array([22, 34, 23, 67], dtype=int64)

# condition filtering

In [21]:
high_above = df[df['Age']> 23]

In [22]:
print(high_above)

    Name  Age    City
1  Kashi   34  morang
3  Binod   67    Dang

# Saving DataFrames

In [ ]:
df.to_csv('trading_Data.csv', index=False)

In [1]:
import pandas as pd

x = {'Student':['David', 'Samul', 'Terry', 'Evan'],
    'Age':[25,44,23,45],
    'Country':['UK', 'Canada','China','USA'],
    'Course':['Python','DataStructure','Machine Learning','Web Development'],
    'Marks':[56,23,56,29]}
df= pd.DataFrame(x)
df

  Student  Age Country            Course  Marks
0   David   25      UK            Python     56
1   Samul   44  Canada     DataStructure     23
2   Terry   23   China  Machine Learning     56
3    Evan   45     USA   Web Development     29

Retrive the marks column and assign it to a variable b

In [2]:
b = df[['Marks']]
b

   Marks
0     56
1     23
2     56
3     29

retrive the country and course columns and assign it to a variablec

In [3]:
c = df[['Country','Course']]
c

  Country            Course
0      UK            Python
1  Canada     DataStructure
2   China  Machine Learning
3     USA   Web Development

### Exercise 2: <code>loc()</code> and <code>iloc()</code> functions

<code>loc()</code> is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it.

Simple syntax for your understanding: 

 - loc[row_label, column_label]

<code>iloc()</code> is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it.

Simple syntax for your understanding: 
   
 - iloc[row_index, column_index]

<h4 id="data">Let us see some examples on the same.</h4>

Accessing the value on the first row and first column

In [4]:
df.iloc[0,0]

'David'

In [5]:
df.iloc[0,3]

'Python'

now accessing using the there name using loc method

In [10]:
df.loc[0, 'Course']

'Python'

In [12]:
df.loc[3, 'Country']

'USA'

In [14]:
df.loc[2,'Course']

'Machine Learning'

Assigning new column

In [17]:
df['Status'] = ['Rich', 'Poor', 'MiddleClass','Rich']
df

  Student  Age Country            Course  Marks       Status
0   David   25      UK            Python     56         Rich
1   Samul   44  Canada     DataStructure     23         Poor
2   Terry   23   China  Machine Learning     56  MiddleClass
3    Evan   45     USA   Web Development     29         Rich

In [18]:
# adding a new column using the assign() method
df = df.assign(address=['jhapa','ktm','morang','dang'])
print(df)

  Student  Age Country            Course  Marks       Status address
0   David   25      UK            Python     56         Rich   jhapa
1   Samul   44  Canada     DataStructure     23         Poor     ktm
2   Terry   23   China  Machine Learning     56  MiddleClass  morang
3    Evan   45     USA   Web Development     29         Rich    dang

we can perform slicing the data using iloc and loc method

In [19]:
df.iloc[0:2, 0:3]

  Student  Age Country
0   David   25      UK
1   Samul   44  Canada

In [20]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
df.loc[0:2,'Student':'Country']

  Student  Age Country
0   David   25      UK
1   Samul   44  Canada
2   Terry   23   China

In [2]:
# conda install xlrd

In [1]:
# conda install openpyxl

In [5]:
# conda install piplite

In [8]:
# conda install pyodide

In [9]:
import pandas as pd
url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/TopSellingAlbums.csv"

In [10]:
df = pd.read_csv(url)
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

In [22]:
import pandas as pd
import requests

url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/TopSellingAlbums.csv"

#send an http get request to the URL
response = requests.get(url)

#check if the request was successful (status code =200)

if response.status_code == 200:
    df = pd.read_csv(url)
    
    df.to_csv('new_data.csv', index= False)
    print("csv file saved successfully")
else:
    print("failed to download csv file")

csv file saved successfully

In [2]:
# conda install request

In [23]:
df

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0
5,Eagles,Their Greatest Hits (1971-1975),1976,0:43:08,"rock, soft rock, folk rock",32.2,42,17-Feb-76,NaN,7.5
6,Bee Gees,Saturday Night Fever,1977,1:15:54,disco,20.6,40,15-Nov-77,Y,7.0
7,Fleetwood Mac,Rumours,1977,0:40:01,soft rock,27.9,40,04-Feb-77,NaN,6.5

In [7]:
x = df[['Length']]
x

    Length
0  0:42:19
1  0:42:11
2  0:42:49
3  0:57:44
4  0:46:33
5  0:43:08
6  1:15:54
7  0:40:01

## Viewing Data and Accessing Data

In [8]:
y=df[['Artist']]
y

            Artist
0  Michael Jackson
1            AC/DC
2       Pink Floyd
3  Whitney Houston
4        Meat Loaf
5           Eagles
6         Bee Gees
7    Fleetwood Mac

In [9]:
z=df[['Artist', 'Length','Genre']]
z

            Artist   Length                        Genre
0  Michael Jackson  0:42:19               pop, rock, R&B
1            AC/DC  0:42:11                    hard rock
2       Pink Floyd  0:42:49             progressive rock
3  Whitney Houston  0:57:44               R&B, soul, pop
4        Meat Loaf  0:46:33  hard rock, progressive rock
5           Eagles  0:43:08   rock, soft rock, folk rock
6         Bee Gees  1:15:54                        disco
7    Fleetwood Mac  0:40:01                    soft rock

# Accessing the value of first row and first column

In [10]:
df.iloc[0,0]

'Michael Jackson'

# Your can access the second row and first column

In [11]:
df.iloc[1,0]

'AC/DC'

 # you can access second row and third colum

In [13]:
df.iloc[1,2]

1980

you can access the column using the name as well

In [14]:
df.loc[1, "Artist"]

'AC/DC'

In [15]:
df.loc[0,"Album"]

'Thriller'

# Slicing the dataframe using the name

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/images/4_loc.png" width="750">

In [17]:
# slicing using value
df.iloc[0:2, 0:3]

            Artist          Album  Released
0  Michael Jackson       Thriller      1982
1            AC/DC  Back in Black      1980

# slicing using  name

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/images/3_loc.png" width="750">

In [18]:
df.loc[0:2, 'Artist':'Released']

            Artist                      Album  Released
0  Michael Jackson                   Thriller      1982
1            AC/DC              Back in Black      1980
2       Pink Floyd  The Dark Side of the Moon      1973

Access the 2nd row and the 3rd column of <code>df</code>:

In [19]:
df.iloc[1,2]

1980

Assign the variable <code>q</code> to the dataframe that is made up of the column <b>Released</b> and <b>Artist</b>:

In [25]:
q=df[['Released','Artist']]
q

   Released           Artist
0      1982  Michael Jackson
1      1980            AC/DC
2      1973       Pink Floyd
3      1992  Whitney Houston
4      1977        Meat Loaf
5      1976           Eagles
6      1977         Bee Gees
7      1977    Fleetwood Mac